{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_2", "layers": [{"class_name": "LSTM", "config": {"name": "lstm_5", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 200, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "use_bias": true, "batch_input_shape": [null, 10, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "stateful": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "return_state": false, "return_sequences": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 200, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "return_state": false, "return_sequences": true, "activation": "tanh", "implementation": 1, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 200, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "return_state": false, "return_sequences": true, "activation": "tanh", "implementation": 1, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "LSTM", "config": {"name": "lstm_8", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 200, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "return_state": false, "return_sequences": true, "activation": "tanh", "implementation": 1, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "LSTM", "config": {"name": "lstm_9", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "unit_forget_bias": true, "units": 200, "go_backwards": false, "unroll": false, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "return_state": false, "return_sequences": false, "activation": "tanh", "implementation": 1, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "units": 36, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid"}}]}}